---
kind: property
id: P:Autodesk.Revit.DB.Electrical.CableTrayConduitRunBase.Length
zh: 长度
source: html/8d9b3472-e7b0-969f-92ee-6708c8263847.htm
---
# Autodesk.Revit.DB.Electrical.CableTrayConduitRunBase.Length Property

**中文**: 长度

The length of the whole (cable tray or conduit) run
 default 0.0

## Syntax (C#)
```csharp
public double Length { get; }
```